; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 2134)
	(= (fuel plane1) 986)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at plane2 city5)
	(= (capacity plane2) 7415)
	(= (fuel plane2) 2844)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 6)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at plane3 city3)
	(= (capacity plane3) 5437)
	(= (fuel plane3) 967)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 4)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 7)
	(at person1 city2)
	(at person2 city2)
	(at person3 city7)
	(at person4 city3)
	(at person5 city9)
	(at person6 city3)
	(at person7 city4)
	(at person8 city5)
	(at person9 city9)
	(at person10 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 892)
	(= (distance city0 city2) 720)
	(= (distance city0 city3) 557)
	(= (distance city0 city4) 911)
	(= (distance city0 city5) 844)
	(= (distance city0 city6) 564)
	(= (distance city0 city7) 655)
	(= (distance city0 city8) 758)
	(= (distance city0 city9) 821)
	(= (distance city1 city0) 892)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 745)
	(= (distance city1 city3) 542)
	(= (distance city1 city4) 707)
	(= (distance city1 city5) 643)
	(= (distance city1 city6) 543)
	(= (distance city1 city7) 682)
	(= (distance city1 city8) 740)
	(= (distance city1 city9) 819)
	(= (distance city2 city0) 720)
	(= (distance city2 city1) 745)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 565)
	(= (distance city2 city4) 888)
	(= (distance city2 city5) 947)
	(= (distance city2 city6) 909)
	(= (distance city2 city7) 800)
	(= (distance city2 city8) 688)
	(= (distance city2 city9) 947)
	(= (distance city3 city0) 557)
	(= (distance city3 city1) 542)
	(= (distance city3 city2) 565)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 598)
	(= (distance city3 city5) 592)
	(= (distance city3 city6) 973)
	(= (distance city3 city7) 888)
	(= (distance city3 city8) 515)
	(= (distance city3 city9) 840)
	(= (distance city4 city0) 911)
	(= (distance city4 city1) 707)
	(= (distance city4 city2) 888)
	(= (distance city4 city3) 598)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 904)
	(= (distance city4 city6) 908)
	(= (distance city4 city7) 560)
	(= (distance city4 city8) 962)
	(= (distance city4 city9) 820)
	(= (distance city5 city0) 844)
	(= (distance city5 city1) 643)
	(= (distance city5 city2) 947)
	(= (distance city5 city3) 592)
	(= (distance city5 city4) 904)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 905)
	(= (distance city5 city7) 527)
	(= (distance city5 city8) 976)
	(= (distance city5 city9) 663)
	(= (distance city6 city0) 564)
	(= (distance city6 city1) 543)
	(= (distance city6 city2) 909)
	(= (distance city6 city3) 973)
	(= (distance city6 city4) 908)
	(= (distance city6 city5) 905)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 848)
	(= (distance city6 city8) 721)
	(= (distance city6 city9) 706)
	(= (distance city7 city0) 655)
	(= (distance city7 city1) 682)
	(= (distance city7 city2) 800)
	(= (distance city7 city3) 888)
	(= (distance city7 city4) 560)
	(= (distance city7 city5) 527)
	(= (distance city7 city6) 848)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 555)
	(= (distance city7 city9) 864)
	(= (distance city8 city0) 758)
	(= (distance city8 city1) 740)
	(= (distance city8 city2) 688)
	(= (distance city8 city3) 515)
	(= (distance city8 city4) 962)
	(= (distance city8 city5) 976)
	(= (distance city8 city6) 721)
	(= (distance city8 city7) 555)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 749)
	(= (distance city9 city0) 821)
	(= (distance city9 city1) 819)
	(= (distance city9 city2) 947)
	(= (distance city9 city3) 840)
	(= (distance city9 city4) 820)
	(= (distance city9 city5) 663)
	(= (distance city9 city6) 706)
	(= (distance city9 city7) 864)
	(= (distance city9 city8) 749)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city2)
	(at plane2 city2)
	(at person1 city2)
	(at person2 city6)
	(at person3 city9)
	(at person4 city2)
	(at person5 city1)
	(at person7 city1)
	(at person8 city3)
	(at person9 city9)
	(at person10 city0)
	))

(:metric minimize (+ (* 2 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (board person7 plane1 city4)
   deleted: (at person7 city4)
   added: (in person7 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 11
2. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 0 to 888, (fuel plane1) from 986 to 98
   goals met: 3 of 11
3. (refuel plane1 city2)
   changed: (fuel plane1) from 98 to 2134
   goals met: 3 of 11
4. (board person8 plane2 city5)
   deleted: (at person8 city5)
   added: (in person8 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 11
5. (board person2 plane1 city2)
   deleted: (at person2 city2)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 11
6. (fly plane2 city5 city3)
   deleted: (at plane2 city5)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 888 to 2664, (fuel plane2) from 2844 to 1068
   goals met: 3 of 11
7. (debark person8 plane2 city3)
   deleted: (in person8 plane2)
   added: (at person8 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 4 of 11
8. (board person10 plane1 city2)
   deleted: (at person10 city2)
   added: (in person10 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 4 of 11
9. (board person4 plane2 city3)
   deleted: (at person4 city3)
   added: (in person4 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 4 of 11
10. (refuel plane2 city3)
   changed: (fuel plane2) from 1068 to 7415
   goals met: 4 of 11
11. (fly plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 2664 to 4359, (fuel plane2) from 7415 to 5720
   goals met: 5 of 11
12. (debark person4 plane2 city2)
   deleted: (in person4 plane2)
   added: (at person4 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 6 of 11
13. (fly plane1 city2 city6)
   deleted: (at plane1 city2)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 4359 to 5268, (fuel plane1) from 2134 to 1225
   goals met: 5 of 11
14. (debark person2 plane1 city6)
   deleted: (in person2 plane1)
   added: (at person2 city6)
   changed: (onboard plane1) from 3 to 2
   goals met: 6 of 11
15. (fly plane2 city2 city7)
   deleted: (at plane2 city2)
   added: (at plane2 city7)
   changed: (total-fuel-used) from 5268 to 7668, (fuel plane2) from 5720 to 3320
   goals met: 5 of 11
16. (board person3 plane2 city7)
   deleted: (at person3 city7)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 5 of 11
17. (fly plane1 city6 city2)
   deleted: (at plane1 city6)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 7668 to 8577, (fuel plane1) from 1225 to 316
   goals met: 6 of 11
18. (refuel plane1 city2)
   changed: (fuel plane1) from 316 to 2134
   goals met: 6 of 11
19. (fly plane2 city7 city2)
   deleted: (at plane2 city7)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 8577 to 10977, (fuel plane2) from 3320 to 920
   goals met: 7 of 11
20. (refuel plane2 city2)
   changed: (fuel plane2) from 920 to 7415
   goals met: 7 of 11
21. (fly plane2 city2 city9)
   deleted: (at plane2 city2)
   added: (at plane2 city9)
   changed: (total-fuel-used) from 10977 to 13818, (fuel plane2) from 7415 to 4574
   goals met: 6 of 11
22. (debark person3 plane2 city9)
   deleted: (in person3 plane2)
   added: (at person3 city9)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 11
23. (fly plane2 city9 city2)
   deleted: (at plane2 city9)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 13818 to 16659, (fuel plane2) from 4574 to 1733
   goals met: 8 of 11
24. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 16659 to 17379, (fuel plane1) from 2134 to 1414
   goals met: 7 of 11
25. (debark person10 plane1 city0)
   deleted: (in person10 plane1)
   added: (at person10 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 8 of 11
26. (fly plane1 city0 city9)
   deleted: (at plane1 city0)
   added: (at plane1 city9)
   changed: (total-fuel-used) from 17379 to 18200, (fuel plane1) from 1414 to 593
   goals met: 8 of 11
27. (refuel plane1 city9)
   changed: (fuel plane1) from 593 to 2134
   goals met: 8 of 11
28. (board person5 plane1 city9)
   deleted: (at person5 city9)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 8 of 11
29. (fly plane1 city9 city1)
   deleted: (at plane1 city9)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 18200 to 19019, (fuel plane1) from 2134 to 1315
   goals met: 8 of 11
30. (debark person5 plane1 city1)
   deleted: (in person5 plane1)
   added: (at person5 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 9 of 11
31. (debark person7 plane1 city1)
   deleted: (in person7 plane1)
   added: (at person7 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 10 of 11
32. (fly plane1 city1 city2)
   deleted: (at plane1 city1)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 19019 to 19764, (fuel plane1) from 1315 to 570
   goals met: 11 of 11
